-- phpMyAdmin SQL Dump
-- version 5.0.4
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1:3306
-- Время создания: Июн 26 2021 г., 18:31
-- Версия сервера: 5.7.29-log
-- Версия PHP: 7.1.33

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `food`
--

-- --------------------------------------------------------

--
-- Структура таблицы `recipes`
--

CREATE TABLE `recipes` (
  `id` int(32) UNSIGNED NOT NULL,
  `name_r` varchar(255) NOT NULL,
  `category_r` varchar(32) NOT NULL,
  `text_r` text NOT NULL,
  `poster_name` varchar(255) NOT NULL,
  `poster_destination` varchar(255) NOT NULL,
  `name_user_add_r` varchar(21) NOT NULL,
  `date_time_add_r` datetime NOT NULL,
  `date_time_update_r` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `recipes`
--

INSERT INTO `recipes` (`id`, `name_r`, `category_r`, `text_r`, `poster_name`, `poster_destination`, `name_user_add_r`, `date_time_add_r`, `date_time_update_r`) VALUES
(20, 'Борщ', 'Перше блюдо', 'М`ясо помити, покласти в кастрюлю, залити гарячою водою і довести до кипіння. Зняти піну, додати сіль та перець і варити 1-год. Цибулю, моркву, часник, буряки й картоплю почистити. Капусту нашаткувати. Буряки й моркву нарізати соломкою, картоплю - кубиками, цибулю й часник подрібнити. Буряки обсмажити в олії, додати трохи больйону й тушкувати близько 20-хв, потів додати в бульйон. Цибулю, моркву і часник пасерувати в олії, додати в бульйон разом із картоплею. Додати капусту і варити ще 10-хв. за 5-хв до готовності додати лавровий лист і зелень.', 'user_img_60d393901cbc20.49133782.jpg', 'img/img_upload_user/user_img_60d393901cbc20.49133782.jpg', 'admin', '2021-06-24 09:03:28', '2021-06-25 20:12:46'),
(22, 'Суп-пюре з гарбуза', 'Перше блюдо', 'Почищені гарбуз і картоплю нарізати кубиками, покласти в кастрюлю, додати 1 склянку води й тушкувати до м`якості. Зелень помити, обсушити й подрібнити. Підготовлені овочі разом із рідиною перебити блендером на пюре. Другу склянку закип`ятити з молоком і додати до пюре. Масу ретельно розмішати й поставити на вогонь. Тільки-но суп закипить присмачити його сіллю та перцем і зменшити вогонь. В окремому посуді розтопити вершкове масло, обсмажити карі та чорний мелений перець. Додати масло зі спеціями в Пуп-пюре і варити ще хвилину. Подавати зі свіжою зеленню і сметаною.', 'user_img_60d39cae256714.65986555.jpg', 'img/img_upload_user/user_img_60d39cae256714.65986555.jpg', 'admin', '2021-06-24 09:05:22', '2021-06-25 20:12:51'),
(23, 'Рататуй', 'Друге блюдо', 'Баклажани помити, нарізати кружальцями завдовжки 3-мм, посолити й залишити на 20-хв. Промити від солі й обсушити. Цукіні та 2-а помідори помити, обсушити такими самими кружальцями, як і баклажани. Подрібнену цибулю обсмажити до золотистого кольору, додати перебиту в блендері м`якоть, присмачити сіллю та перцем і тушкувати 10-хв. На дно форми для запікання викласти томатний соус. Укласти, чергуючи, овочі: кружальце помідора, кружальце баклажана, кружальце кабачка. Рататуй посолити, притрусити подрібленим часником та гострим перцем і скропити олією. Накрити форму пергаментним папером і запікати овочі 1-год за температури 180` С.', 'user_img_60d39d17a3d922.79217703.jpg', 'img/img_upload_user/user_img_60d39d17a3d922.79217703.jpg', 'admin', '2021-06-24 09:10:07', '2021-06-25 20:12:54'),
(24, 'Оселедець під шубою у склянках', 'Салат', 'Буряки, моркву й картоплю вимити і відварити. Облити холодною одою, охолодити, почистити нарізати однаковими кубиками. Оселедець почистити, відокремити філе й нарізати кубиками. Почистити і дрібно нарізати цибулю. Яблуко почистити й нарізати кубиками. Змішати яблуко, цибулю та оселедець із лимонним соком і цедрою, присмачити перцем. Викладати салат у склянки шарами в такій послідовності: картопля, оселедець із яблуком і цибулею, морква, буряк. Шар моркви з двох боків змастити майонезом і притрусити перцем. Верх салату прикрасити майонезом і зеленню. Дати настоятися в холодильнику 4-8 годин.', 'user_img_60d422658fd525.86100247.jpg', 'img/img_upload_user/user_img_60d422658fd525.86100247.jpg', 'admin', '2021-06-24 09:12:53', '2021-06-25 20:12:57'),
(25, 'Крабовий салат із кукурудзою, огірками та яйцями', 'Салат', 'Яйця відварити, охолодити й почистити. Зелену цибулю та огірок промити й обсушити. Кукурудзу відкинути на друшляк. Яйця, огірок і крабові палички нарізати кубиками зі стороною 1-см. Плавлений нарізати дрібніше - кубики по 5-мм. Зелену цибулю посікти. Викладати салат порційно в келихи, чергуючи шари і змащуючи їх майонезом на смак. Верхній зробити з кукурудзи. Прикрасити зеленню й слайсами з огірка.', 'user_img_60d46cf6272b75.63234818.jpg', 'img/img_upload_user/user_img_60d46cf6272b75.63234818.jpg', 'admin', '2021-06-24 14:31:02', '2021-06-25 20:13:00'),
(26, 'Курка, запечена з грибами та вершками', 'Випічка', 'Куряче філе зварити до готовності. Цибулю й часник почистити, дрібно нарізати й обсмажити у вершковому маслі. Гриби помити, нарізати й додати в сковородку із цибулею. Тушкувати 2 хвилини. Додати вершки, довести до кипіння, присмачити сіллю та перцем, накрити кришкою і готувати ще 10 хвилин. Куряче філе нарізати невеликими шматочками, сир натерти. У змащену олією формою викласти курятину, зверху покласти гриби й тертий сир. Запікати в заздалегідь розігрітій до 180°С духовці 20 хвилин. ', 'user_img_60d46fd492b116.89826862.jpg', 'img/img_upload_user/user_img_60d46fd492b116.89826862.jpg', 'admin', '2021-06-24 14:43:16', '2021-06-25 20:13:03'),
(28, 'Яблучна шарлотка', 'Випічка', 'Цукор і яйця збити міксером. Додати просіяне борошно і знову збити. Всипати соду і скропити соком лимона. Посолити тісто і перемішати. Форму для випікання змастити вершковим маслом. Почистити й нарізати яблука, викласти ними дно форми. Вилити збиту масу на яблука, вирівняти поверхню пирога і прикрасити тонкими шматочками яблук. Випікати шарлотку в розігрітій до 180°С духовці протягом 40 хвилин.', 'user_img_60d470c6445358.36175842.jpg', 'img/img_upload_user/user_img_60d470c6445358.36175842.jpg', 'admin', '2021-06-24 14:47:18', '2021-06-25 20:12:38'),
(29, 'Вегетеріанська піца', 'Піца', 'Борошно просіяти, додати сіль, дріжджі, воду й оливкову олію. Замісити тісто, скачати його в кулю, накрити серветкою і поставити на годину в тепле місце. Тісто, що підійшло, розкачати в круг, викласти основу в форму для запікання, змастити томатним соусом. Повикладати на томатний соус маслини, шматочки ананасів і кружальця помідорів, притрусити тертим сиром. Випікати піцу в розігрітій до 200°С духовці близько 20 хвилин. Готову піцу прикрасити зеленню.', 'user_img_60d471e76fcc34.14785988.jpg', 'img/img_upload_user/user_img_60d471e76fcc34.14785988.jpg', 'admin', '2021-06-24 14:52:07', '2021-06-25 20:12:34'),
(30, 'Піца з куркою та грибами', 'Піца', 'Борошно просіяти, додати сіль, дріжджі, воду й оливкову олію. Замісити тісто, скачати його в кулю, накрити серветкою і поставити на годину в тепле місце. Духовку розігріти до 220°С. Тісто обім`яти, трохи вимісити, розкачати в круг і викласти на змащене олією деко. Сир натерти, відварене куряче філе та гриби нарізати шматочками. Змастити тісто томатним соусом, притрусити тертим сиром, розкласти гриби й курятину. Притрусити піцу орегано, скропити оливковою олією й випікати 15 хвилин. ', 'user_img_60d47277ee65c9.27256452.jpg', 'img/img_upload_user/user_img_60d47277ee65c9.27256452.jpg', 'admin', '2021-06-24 14:54:31', '2021-06-25 20:12:31'),
(32, 'Сирно-шоколадний десерт із бананами', 'Десерт', 'Какао і крохмаль розвести у 200-мл молока, додати цукор, жовтки й перемішати. Решту молока довести до кипіння і, помішуючи, влити тонкою цівкою в готову суміш. Тільки-но вона закипить, додати сир, сметану, цукор і ванільний цукор. Банани почистити й нарізати кружальцями. У склянки викласти шоколадний пудинг, зверху – кружальця бананів і сирний крем. Прибрати на 30-хв у холодильник. Перед подачею притрусити подрібненими горіхами. ', 'user_img_60d47582d41c77.49362769.jpg', 'img/img_upload_user/user_img_60d47582d41c77.49362769.jpg', 'admin', '2021-06-24 15:07:30', '2021-06-25 20:12:28'),
(33, 'Огірковий смузі з лаймом та м`ятою', 'Напій', 'Огірки помити й почистити від шкірки. Крупно нарізати. Листочки м`яти помити й подрібнити. У ємності з`єднати огірки з м`ятою і додати 1-ст. ложку меду У ємність з інгредієнтами вичавити сік лайма. Усі інгредієнти подрібнити блендером до однорідної маси. Перед подачею склянку потрібно потримати 5-хв в холодильнику і вже потім наливати в неї смузі. Додати трохи колотого льоду і прикрасити листочками м`яти. В огірковий смузі також можна додати ківі, яблука, авокадо, селеру, імбир на смак. ', 'user_img_60d47617d48142.82438426.jpg', 'img/img_upload_user/user_img_60d47617d48142.82438426.jpg', 'admin', '2021-06-24 15:09:59', '2021-06-25 20:12:25'),
(34, 'Калиновий сік ', 'Напій', 'Калину помити й обсушити. Чист ягоди покласти в каструлю, залити водою і варити близько 5 хвилин. Ягоди відтиснути крізь марлю, складену в декілька шарів, відвар процідити. До отриманого соку додати цукор і варити на повільному вогні доти, поки цукор повністю не розчиниться. Гарячим розлити напій у стерилізовані банки й закупорити. Зберігати в прохолодному приміщенні. За цим рецептом можна приготувати сік із калини з медом, замінивши 200-г цукру 4-ст. ложками желе, соусу та пастила.', 'user_img_60d477036fc698.87727793.png', 'img/img_upload_user/user_img_60d477036fc698.87727793.png', 'admin', '2021-06-24 15:13:55', '2021-06-25 20:12:23'),
(35, 'Перець, запечений із бринзою', 'Друге блюдо', 'Цибулю почистити й дрібно нарізати. Обсмажити цибулю в суміші вершкового масла й олії на сильному вогні. Бланшувати помідор, видалити шкірку й насіння, нарізати кубиками. Дрібно посікти зелень. Перець розрізати навпіл, видалити насіння. У мисці розім`яти бринзу. Додати до неї смажену цибулю, помідор, зелень, жовток, мелений перець, підсолити, якщо потрібно. Половинки перцю заповнити начинкою, викласти у змащену форму, посипати панірувальними сухарями. Запікати 35-хв за температури 160°С.', 'user_img_60d479a762a848.85571483.jpg', 'img/img_upload_user/user_img_60d479a762a848.85571483.jpg', 'admin', '2021-06-24 15:25:11', '2021-06-25 20:12:20'),
(36, 'Торт із полуничним джемом ', 'Десерт', 'У яєць відокремити білки від жовтків. Збити білки із 4 ст. ложки цукру в цупку піну до стійких піків. Змішати всі інші інгредієнти до однорідності, акуратно ввести білки, ретельно перемішати. Викласти масу в змащену олією форму й випікати в розігрітій до 180°С духовці 50 хвилин. Охолоджений корж розрізати навпіл. Желе розчинити в 2 склянках гарячої води, трохи охолодити й поставити в холодильник до повного охолодження. У форму викласти один корж, залити частиною желе, зверху накрити другим коржем, викласти нарізану полуницю й залити рештою желе. Поставити торт на 4 години у холодильник. ', 'user_img_60d4876dced9a0.67171091.jpg', 'img/img_upload_user/user_img_60d63670a3a4d6.36037967.jpg', 'admin', '2021-06-24 16:23:57', '2021-06-25 20:08:51');

-- --------------------------------------------------------

--
-- Структура таблицы `users`
--

CREATE TABLE `users` (
  `id` int(32) NOT NULL,
  `login` varchar(21) NOT NULL,
  `password` varchar(32) NOT NULL,
  `date_time_add_user` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `users`
--

INSERT INTO `users` (`id`, `login`, `password`, `date_time_add_user`) VALUES
(1, 'Andertan', '3d6ddcbfb7572c7ee216529666ee4d20', '2021-06-23 16:25:02');

-- --------------------------------------------------------

--
-- Структура таблицы `users_admin`
--

CREATE TABLE `users_admin` (
  `id` int(32) UNSIGNED NOT NULL,
  `privilege` varchar(32) CHARACTER SET utf8 COLLATE utf8_bin DEFAULT NULL,
  `login` varchar(21) NOT NULL,
  `password` varchar(32) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `users_admin`
--

INSERT INTO `users_admin` (`id`, `privilege`, `login`, `password`) VALUES
(2, '1', 'admin', 'df847f0e0feddc1999c7417d3e3e6534');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `recipes`
--
ALTER TABLE `recipes`
  ADD UNIQUE KEY `id` (`id`);

--
-- Индексы таблицы `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `users_admin`
--
ALTER TABLE `users_admin`
  ADD UNIQUE KEY `id` (`id`),
  ADD UNIQUE KEY `privilege` (`privilege`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `recipes`
--
ALTER TABLE `recipes`
  MODIFY `id` int(32) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=37;

--
-- AUTO_INCREMENT для таблицы `users`
--
ALTER TABLE `users`
  MODIFY `id` int(32) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT для таблицы `users_admin`
--
ALTER TABLE `users_admin`
  MODIFY `id` int(32) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
